#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-2oqsBgFFsA7YcwMp

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
module.postgres_backups_bucket.random_id.this: Refreshing state... [id=Ze9c]
module.remote_state_bucket.random_id.this: Refreshing state... [id=WvCN]
module.config_bucket.random_id.this: Refreshing state... [id=aPbH]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_ecr_repository.uptime: Refreshing state... [id=uptime]
module.database.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/database-policy]
module.config_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-68f6c7]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
data.aws_iam_policy_document.assume_role: Refreshing...
data.aws_iam_policy_document.uptime_trigger_assume_role: Refreshing...
module.postgres_backups_bucket.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-65ef5c]
data.aws_iam_policy_document.uptime_trigger_assume_role: Refresh complete after 0s [id=52247394]
data.aws_iam_policy_document.assume_role: Refresh complete after 0s [id=2690255455]
module.database.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
module.database.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
aws_iam_user.image_builder: Refreshing state... [id=image.builder]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
module.remote_state_bucket.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-5af08d]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
aws_sns_topic.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.secondary.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
aws_iam_role.uptime: Refreshing state... [id=uptime]
module.database.aws_iam_role.this: Refreshing state... [id=database-role]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
aws_iam_access_key.image_builder: Refreshing state... [id=AKIAYEHTA3LZI2GLLBWM]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
module.secondary.aws_iam_role.this: Refreshing state... [id=secondary-role]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
module.database.aws_iam_instance_profile.this: Refreshing state... [id=database-instance-profile]
module.database.aws_iam_role_policy_attachment.this: Refreshing state... [id=database-role-20231230120447701700000002]
module.secondary.aws_iam_instance_profile.this: Refreshing state... [id=secondary-instance-profile]
module.secondary.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/secondary-policy]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_iam_user_policy.image_builder: Refreshing state... [id=image.builder:image.builder.policy]
aws_lambda_function.uptime: Refreshing state... [id=uptime]
module.secondary.aws_iam_role_policy_attachment.this: Refreshing state... [id=secondary-role-20231105112810173300000001]
aws_sns_topic_subscription.outages: Refreshing state... [id=arn:aws:sns:eu-west-1:558855412466:outages:c15a0919-9e06-484e-bef6-08ab63e662d8]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.secondary.data.aws_subnet.self: Refreshing...
module.database.data.aws_subnet.self: Refreshing...
module.database.aws_ebs_volume.this: Refreshing state... [id=vol-0ac43ea68879b3895]
module.database.aws_security_group.this: Refreshing state... [id=sg-0998f7db6e1ffb7eb]
module.secondary.aws_security_group.this: Refreshing state... [id=sg-06499fd654cd0b866]
module.secondary.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.database.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.config_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-68f6c7]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
module.postgres_backups_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-65ef5c]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.database.aws_security_group_rule.allow_inbound_postgres: Refreshing state... [id=sgrule-3465932672]
module.database.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-3173870365]
module.database.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-1306823711]
module.database.aws_instance.this: Refreshing state... [id=i-0e48bcc2a0d16252e]
module.database.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-1983782041]
module.remote_state_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-5af08d]
module.secondary.aws_security_group_rule.allow_inbound_ipv6_ssh: Refreshing state... [id=sgrule-769416183]
module.secondary.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-350438361]
module.secondary.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1760375090]
module.secondary.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-3245959933]
module.secondary.aws_security_group_rule.allow_inbound_ipv6_https: Refreshing state... [id=sgrule-3593912321]
module.secondary.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-2531630954]
module.secondary.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3873468700]
module.secondary.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-3592804283]
module.secondary.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-978673540]
module.secondary.aws_instance.this: Refreshing state... [id=i-0d506cd22642eedac]
module.database.aws_security_group_rule.allow_inbound_connections_from_instances["sg-06499fd654cd0b866"]: Refreshing state... [id=sgrule-4280258016]
module.database.aws_volume_attachment.this: Refreshing state... [id=vai-3516952077]
module.secondary.aws_eip.this: Refreshing state... [id=eipalloc-004b70de70a6e650a]
aws_route53_record.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]
aws_route53_record.opentracker_tags: Refreshing state... [id=Z03017682LQ8TW5YUFGE0_tags_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.uptime_trigger will be created
  + resource "aws_iam_policy" "uptime_trigger" {
      + arn         = (known after apply)
      + description = "Policy for uptime-trigger-role"
      + id          = (known after apply)
      + name        = "uptime-trigger"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:InvokeFunction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:eu-west-1:558855412466:function:uptime"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.uptime_trigger will be created
  + resource "aws_iam_role" "uptime_trigger" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "scheduler.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "uptime-trigger"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.uptime_trigger will be created
  + resource "aws_iam_role_policy_attachment" "uptime_trigger" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "uptime-trigger"
    }

  # aws_scheduler_schedule.uptime will be created
  + resource "aws_scheduler_schedule" "uptime" {
      + arn                          = (known after apply)
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "uptime-trigger"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "rate(1 minutes)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:lambda:eu-west-1:558855412466:function:uptime"
          + role_arn = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>